---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wood.TextureAngle
source: html/c4d3a1ed-e78c-d278-be6f-2a6c71136f69.htm
---
# Autodesk.Revit.DB.Visual.Wood.TextureAngle Property

The property labeled "Angle" from the "Wood" schema.

## Syntax (C#)
```csharp
public static string TextureAngle { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray3d".